console.log(`
Выполненные пункты:
1) верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/  Валидной вёрстке соответствует надпись 'Document checking completed. No errors or warnings to show.' В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований 

2) логотип в хедере состоит из текстовых элементов 

3) страница содержит ровно один элемент 'h1' 

4) добавлен favicon 

5) блок 'header' 

6) блок 'Not only' 

7) блок 'About' 

8) блок 'Our Friends' 

9) блок 'Help' 

10) блок 'In addition' 

11) блок 'footer' 

12) для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid) 

13) при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px). вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине 

14) фоновый цвет тянется на всю ширину страницы 

15) элемент 'About the Shelter' в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны 

16) каждая карточка с питомцем в блоке 'Our Friends' интерактивна при наведении на любую область этой карточки 

17) плавная прокрутка по якорям 

18) выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы 'Main' 

19) выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства 'cursor: pointer', но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета 

20) обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы 

21) верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . +4 Валидной вёрстке соответствует надпись 'Document checking completed. No errors or warnings to show.' В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований 

22) логотип в хедере состоит из текстовых элементов 

23) страница содержит ровно один элемент 'h1' 

24) добавлен favicon 

25) блок 'header' 

26) блок 'Our Friends' 

27) блок 'footer' 

28) при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине 

29) фоновый цвет тянется на всю ширину страницы 

30) элемент 'Our pets' в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны 

31) доступные кнопки пагинации (вправо) активны, недоступные (влево) - неактивны (disabled) 

32) каждая карточка с питомцем в блоке 'Our Friends' интерактивна при наведении на любую область этой карточки 

33) плавная прокрутка по якорям 

34) выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы 'Pets' 

35) выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства 'cursor: pointer', но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета 

36) обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы 

`);
